uhnp/src/DataProcessors/АналитическийБланкСводнаяТаблица/АналитическийБланкСводнаяТаблица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АналитическийБланкСводнаяТаблица</name>
  <tabularSections>
    <name>ТаблицаИзмененныхПоказателей</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательОтчета</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>CatalogRef.ПроизвольныйКлассификаторУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВалюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинтетическоеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаблокировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСостояния</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/Enums/ДоступныеСвойстваОформленияСводнойТаблицы/ДоступныеСвойстваОформленияСводнойТаблицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДоступныеСвойстваОформленияСводнойТаблицы</name>
  <enumValues>
    <name>ЦветФона</name>
  </enumValues>
  <enumValues>
    <name>ЦветТекста</name>
  </enumValues>
  <enumValues>
    <name>Формат</name>
  </enumValues>
  <enumValues>
    <name>Шрифт</name>
  </enumValues>
  <enumValues>
    <name>Картинка</name>
  </enumValues>
  <enumValues>
    <name>РазмерКартинки</name>
  </enumValues>
  <enumValues>
    <name>ВертикальноеПоложениеКартинки</name>
  </enumValues>
  <enumValues>
    <name>ГоризонтальноеПоложениеКартинки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/АналитическийБланкСводнаяТаблица/Forms/ФормаВыбораОформляемыхСвойств/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

 		ЗаполнитьТаблицуДоступныхСвойств();		
		
		Для Каждого ЗначениеПараметра Из Параметры.Оформление Цикл
			
			ТекущийПараметр = ДоступныеСвойства.НайтиСтроки(Новый Структура("ПредставлениеСвойства",ЗначениеПараметра.Представление));
			Если ТекущийПараметр.Количество() = 1 Тогда
				 ТекущийПараметр[0].Пометка 			= ЗначениеПараметра.Пометка;
				 ТекущийПараметр[0].ЗначениеСвойства    = ЗначениеПараметра.Значение;
			КонецЕсли;
			
		КонецЦикла;	
		
КонецПроцедуры

Процедура ЗаполнитьТаблицуДоступныхСвойств()
			
	Для Каждого СтрПараметрОформления Из Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы Цикл	
				
		
		НоваяСтрока  						= ДоступныеСвойства.Добавить();
		НоваяСтрока.ЗаголовокСвойства 		= СтрПараметрОформления;		
		НоваяСтрока.ПредставлениеСвойства  	= СтрПараметрОформления.Метаданные().Имя;
		
		ИндексЗначенияПеречисления = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.Индекс(СтрПараметрОформления);
		НоваяСтрока.ПредставлениеСвойства = Метаданные.Перечисления["ДоступныеСвойстваОформленияСводнойТаблицы"].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
			
		УстановитьЗначениеСвойстваПоУмолчанию(НоваяСтрока);
		
	КонецЦикла;
		
КонецПроцедуры	

Процедура УстановитьЗначениеСвойстваПоУмолчанию(НоваяСтрока)

	Если НоваяСтрока.ЗаголовокСвойства 			 = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.ЦветФона
		ИЛИ НоваяСтрока.ЗаголовокСвойства = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.ЦветТекста  Тогда 
		
		НоваяСтрока.ЗначениеСвойства = Новый Цвет();
		
	ИначеЕсли НоваяСтрока.ЗаголовокСвойства = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.Шрифт Тогда
		
		НоваяСтрока.ЗначениеСвойства = Новый Шрифт();
		
	ИначеЕсли НоваяСтрока.ЗаголовокСвойства = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.Картинка Тогда
		
		НоваяСтрока.ЗначениеСвойства = Новый Картинка;
		
	ИначеЕсли НоваяСтрока.ЗаголовокСвойства = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.ВертикальноеПоложениеКартинки Тогда
		
		НоваяСтрока.ЗначениеСвойства = ВертикальноеПоложение.Верх;
		
	ИначеЕсли НоваяСтрока.ЗаголовокСвойства = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.ГоризонтальноеПоложениеКартинки Тогда
		
		НоваяСтрока.ЗначениеСвойства = ГоризонтальноеПоложение.Право;
		
	ИначеЕсли НоваяСтрока.ЗаголовокСвойства = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.Формат Тогда
		
		НоваяСтрока.ЗначениеСвойства = "";
		
	ИначеЕсли НоваяСтрока.ЗаголовокСвойства = Перечисления.ДоступныеСвойстваОформленияСводнойТаблицы.РазмерКартинки Тогда
		
		НоваяСтрока.ЗначениеСвойства = РазмерКартинки.АвтоРазмер;
		
	КонецЕсли;	
	

КонецПроцедуры	


&НаКлиенте
Процедура ДоступныеСвойстваПриАктивизацииЯчейки(Элемент)

 Если Элемент.ТекущийЭлемент.Имя = "ЗначениеСвойства" Тогда 
		
		Если Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.ЦветФона")
			ИЛИ Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.ЦветТекста")  Тогда
			
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("Цвет");
			
		ИначеЕсли Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.Шрифт") Тогда
			
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("Шрифт");
			
		ИначеЕсли Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.Картинка") Тогда
			
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("Картинка");
			
		ИначеЕсли Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.ВертикальноеПоложениеКартинки") Тогда
			
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("ВертикальноеПоложение");
			
		ИначеЕсли Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.ГоризонтальноеПоложениеКартинки") Тогда
			
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("ГоризонтальноеПоложение");
			
		ИначеЕсли Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.Формат") Тогда
			
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
					
		ИначеЕсли Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.РазмерКартинки") Тогда
			
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов("РазмерКартинки");
											
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеСвойства = Новый СписокЗначений;
	
	Для Каждого ДоступноеСвойство Из ДоступныеСвойства Цикл
		Если ДоступноеСвойство.Пометка Тогда
			ВыбранныеСвойства.Добавить(ДоступноеСвойство.ЗначениеСвойства,ДоступноеСвойство.ПредставлениеСвойства,ДоступноеСвойство.Пометка);
		КонецЕсли;	
	КонецЦикла;	
	
	Закрыть(ВыбранныеСвойства);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеСвойстваПриИзменении(Элемент)

   Элементы.ДоступныеСвойства.ТекущиеДанные.Пометка = Истина;


КонецПроцедуры

&НаКлиенте
Процедура ЗначениеСвойстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если  Элементы.ДоступныеСвойства.ТекущиеДанные.ЗаголовокСвойства = ПредопределенноеЗначение("Перечисление.ДоступныеСвойстваОформленияСводнойТаблицы.Формат") Тогда
		
		СтандартнаяОбработка  = Ложь;
		
		Конструктор = Новый КонструкторФорматнойСтроки(Элементы.ДоступныеСвойства.ТекущиеДанные.ЗначениеСвойства);
		
		Если Конструктор.ОткрытьМодально() Тогда
			
			Элементы.ДоступныеСвойства.ТекущиеДанные.ЗначениеСвойства = Конструктор.Текст;
			
		КонецЕсли;		  
		
	КонецЕсли;		
			
КонецПроцедуры
